<?php 

$file = '../locale/matrixA.txt';
	$mass = array(  array(5,17,26,28,29,39,48),	/*Київ (1)*/
					array(30,31,32,34,45),	/*Харків (2)*/
					array(8,32,33,34,35,45),		/*Полтава (3)*/
					array(36,37,38,50,65,66),		/*Кропивницький (4)*/
					array(27,39,40),		/*Чернігів (5)*/

					array(43,44,45),		/*Суми (6)*/
					array(33,35,38,46,47,48,49),/*Черкаси (7)*/
					array(11,32,33,36,50,51,52),/*Дніпро (8)*/
					array(53,54),			/*Луганськ (9)*/
					array(11,52,55,56,57,58,59,60),/*Донецьк (10)*/

					array(52,61,63),	/*Запоріжжя (11)*/
					array(13,25,50,64),				/* (12)*/   /*Херсон*/
					array(14,50,65,66),				/* (13)*//*Миколаїв*/
					array(67,68),				/* (14)*//*Одеса*/
					array(16,69,70,74),				/* (15)*//*Вінниця*/

					array(71,72,73),				/* (16)*//*Хмельницький*/
					array(28,74,75,76),				/* (17)*//*Житомир*/
					array(19,73,75,77,78),				/* (18)*//*Рівне*/
					array(77,79,81),				/* (19)*//*Луцьк*/
					array(21,82,83,90),				/* (20)*//*Львів*/

					array(72,84,85,86),				/* (21)*//*Тернопіль*/
					array(87,88,89,92),				/* (22)*//*Чернівці*/
					array(83,87,90,91,92),				/* (23)*//*Івано-Франківськ*/
					array(93),				/* (24)*//*Ужгород*/
					array(94,95),				/* (25)*//*Сімферополь*/

					array(27),				/* (26)*/
					array(),				/* (27)*/
					array(29,47),				/* (28)*/
					array(48),				/* (29)*/
					array(31,54,57),				/* (30)*/

					array(51),				/* (31)*/
					array(),				/* (32)*/
					array(36),				/* (33)*/
					array(45),				/* (34)*/
					array(41,44,49),				/* (35)*/

					array(38),				/* (36)*/
					array(38,46,65),				/* (37)*/
					array(),				/* (38)*/
					array(40),				/* (39)*/
					array(41,42),				/* (40)*/

					array(44),				/* (41)*/
					array(43),				/* (42)*//*0000000*/
					array(44),				/* (43)*/
					array(),				/* (44)*/
					array(),				/* (45)*/

					array(47,65,68,70),				/* (46)*/
					array(),				/* (47)*/
					array(49),				/* (48)*/
					array(),			/* (49)*/
					array(66),				/* (50)*/

					array(59),				/* (51)*/
					array(59,63),				/* (52)*/
					array(60),				/* (53)*/
					array(58),				/* (54)*/
					array(62,63),				/* (55)*/

					array(60),				/* (56)*/
					array(58),				/* (57)*/
					array(),				/* (58)*/
					array(),				/* (59)*/
					array(),				/* (60)*/

					array(62,64),				/* (61)*/
					array(63),				/* (62)*/ /*0000000*/
					array(),				/* (63)*/
					array(),				/* (64)*/
					array(68),				/* (65)*/

					array(),			/* (66)*/
					array(),				/* (67)*/
					array(),				/* (68)*/
					array(70,88),				/* (69)*/
					array(),				/* (70)*/

					array(88),				/* (71)*/
					array(),				/* (72)*/
					array(74,75),			/* (73)*/
					array(),				/* (74)*/
					array(76),				/* (75)*/

					array(),				/* (76)*/
					array(84),				/* (77)*/
					array(),				/* (78)*/
					array(80),				/* (79)*/
					array(),				/* (80)*/

					array(82),				/* (81)*/
					array(84),				/* (82)*/
					array(90,91,93),				/* (83)*/
					array(),				/* (84)*/
					array(90),				/* (85)*/

					array(87),				/* (86)*/
					array(),				/* (87)*/
					array(),				/* (88)*/
					array(),				/* (89)*/
					array(),				/* (90)*/

					array(),				/* (91)*/
					array(),				/* (92)*/
					array(),				/* (93)*/
					array(),				/* (94)*/
					array()				/* (95)*/

				);
			
	file_put_contents($file, serialize($mass));
	
	
	$matrix = unserialize(file_get_contents($file));
	echo json_encode($matrix);



	$mass1 = array(  array(154,148,81.8,86.5,105,74.4,134),	/*Київ (1)*/
					array(125,147,106,91.9,111),	/*Харків (2)*/
					array(160,80.4,113,52.3,144,101),		/*Полтава (3)*/
					array(77,119,54.5,120,127,132),		/*Кропивницький (4)*/
					array(154,89.3,67.7,90.3),		/*Чернігів (5)*/

					array(128,103,78.9),		/*Суми (6)*/
					array(128,121,70.3,186,206,77.8,20.5),/*Черкаси (7)*/
					array(84.6,117,161,169,146,76.8,127),/*Дніпро (8)*/
					array(42.2,88.8),			/*Луганськ (9)*/
					array(250,136,113,70.5,122,122,86.3,57.7),/*Донецьк (10)*/

					array(94,125,110),	/*Запоріжжя (11)*/
					array(71.2,264,222,84),				/* (12)*/   /*0000000*/ 
					array(132,233,164,106),				/* (13)*//*0000000*/
					array(256,105),				/* (14)*//*0000000*/
					array(119,118,95,86.6),				/* (15)*//*0000000*/

					array(92.6,67.9,101),				/* (16)*//*0000000*/
					array(139,41,84.8,86.8),				/* (17)*//*0000000*/
					array(72.6,95.4,102,47.3,92.6),				/* (18)*//*0000000*/
					array(55.7,73,52.2),				/* (19)*//*0000000*/
					array(139,71.4,71.3,72.3),				/* (20)*//*0000000*/

					array(50.1,70.7,55.2,74.5),				/* (21)*//*0000000*/
					array(48.5,90.1,70.8,76.6),				/* (22)*//*0000000*/
					array(101,112,60.2,61.4,61.9),				/* (23)*//*0000000*/
					array(40.6),				/* (24)*//*0000000*/
					array(81.3,112),				/* (25)*//*0000000*/

					array(52.9),				/* (26)*/
					array(),				/* (27)*/
					array(77.3,67.6),				/* (28)*/
					array(40.9),				/* (29)*/
					array(99.8,132,72.1),				/* (30)*/

					array(61.4),				/* (31)*/
					array(2,3,8),				/* (32)*/
					array(59.6),				/* (33)*/
					array(91.8),				/* (34)*/
					array(90.1,111,91.8),				/* (35)*/

					array(86.1),				/* (36)*/
					array(142,54.7,106),				/* (37)*/
					array(),				/* (38)*/
					array(70.6),				/* (39)*/
					array(67.6,85.7),				/* (40)*/

					array(84.2),				/* (41)*/
					array(30.5),				/* (42)*//*0000000*/
					array(68.2),				/* (43)*/
					array(),				/* (44)*/
					array(),				/* (45)*/

					array(61.8,117,113,67),				/* (46)*/
					array(),				/* (47)*/
					array(65.1),				/* (48)*/
					array(),			/* (49)*/
					array(76.9),				/* (50)*/

					array(111),				/* (51)*/
					array(106,65.3),				/* (52)*/
					array(74.1),				/* (53)*/
					array(65.1),				/* (54)*/
					array(84.4,123),				/* (55)*/

					array(51.3),				/* (56)*/
					array(50.2),				/* (57)*/
					array(),				/* (58)*/
					array(),				/* (59)*/
					array(),				/* (60)*/

					array(121,162),				/* (61)*/
					array(97.6),				/* (62)*/ /*0000000*/
					array(),				/* (63)*/
					array(),				/* (64)*/
					array(69.5),				/* (65)*/

					array(),			/* (66)*/
					array(),				/* (67)*/
					array(),				/* (68)*/
					array(159,118),				/* (69)*/
					array(),				/* (70)*/

					array(39.3),				/* (71)*/
					array(),				/* (72)*/
					array(147,70.6),			/* (73)*/
					array(),				/* (74)*/
					array(107),				/* (75)*/

					array(),				/* (76)*/
					array(37),				/* (77)*/
					array(),				/* (78)*/
					array(54.2),				/* (79)*/
					array(),				/* (80)*/

					array(61.5),				/* (81)*/
					array(141),				/* (82)*/
					array(68.5,41.5,160),				/* (83)*/
					array(),				/* (84)*/
					array(31.8),				/* (85)*/

					array(48.6),				/* (86)*/
					array(),				/* (87)*/
					array(),				/* (88)*/
					array(),				/* (89)*/
					array(),				/* (90)*/
					
					array(),				/* (91)*/
					array(),				/* (92)*/
					array(),				/* (93)*/
					array(),				/* (94)*/
					array()				/* (95)*/
				);



	$matrix_adjacency = array();
	$matrix_distance = array();

	$k = 0;
	$temp = 10;

	for($i = 0; $i < count($matrix); $i++) {
		for($j = $k; $j < count($matrix); $j++)
		{
			$matrix_adjacency[$i][$j] = 0;
			$matrix_adjacency[$j][$i] = 0;

			$matrix_distance[$i][$j] = 0;
			$matrix_distance[$j][$i] = 0;

			if($i != $j) 
			{
				for($tmp = 0; $tmp < count($matrix[$i]); $tmp++)
				{
					if($matrix[$i][$tmp] == ($j + 1)) {						
						$matrix_adjacency[$i][$j] = 1;
						$matrix_adjacency[$j][$i] = 1;

						$matrix_distance[$i][$j] = $mass1[$i][$tmp];
						$matrix_distance[$j][$i] = $matrix_distance[$i][$j];
					}	
				}
			}	
		}
		$k++;
		//$temp++;		
	}

/*	echo '<br>';	echo '<br>';
	foreach ($matrix_distance as $key) {
		foreach ($key as $value) {
			echo $value.' | ';
		}
		echo '<br>';
	}
*/


	file_put_contents('../locale/matrixAdjacency.txt', serialize($matrix_adjacency));
	file_put_contents('../locale/matrixDistance.txt', serialize($matrix_distance));

?>